In [1]:
import pandas as pd

In [2]:
gl = pd.read_csv('./dataset_raw_full.csv')
gl

,Latitude,Longitude,Altitude,Date_Time,Id_user,Id_perc,Label
0,41.741415,86.186028,-777.0,2008-03-31 16:00:08,10,20080331160008.plt,taxi
1,41.737063,86.179470,-777.0,2008-03-31 16:01:07,10,20080331160008.plt,taxi
2,41.734105,86.172823,-777.0,2008-03-31 16:02:07,10,20080331160008.plt,taxi
3,41.739110,86.166563,-777.0,2008-03-31 16:03:06,10,20080331160008.plt,taxi
4,41.744368,86.159987,-777.0,2008-03-31 16:04:05,10,20080331160008.plt,taxi
...,...,...,...,...,...,...,...
3387298,40.070186,116.314153,-45.0,2008-11-29 02:01:31,179,20081129015805.plt,bus
3387299,40.070193,116.314041,-48.0,2008-11-29 02:01:33,179,20081129015805.plt,bus
3387300,40.070224,116.313923,-51.0,2008-11-29 02:01:35,179,20081129015805.plt,bus
3387301,40.070227,116.313843,-56.0,2008-11-29 02:01:37,179,20081129015805.plt,bus
3387302,40.070242,116.313808,-58.0,2008-11-29 02:01:39,179,20081129015805.plt,bus

In [3]:
gl = gl.rename(mapper={
    'Latitude': 'lat',
    'Longitude': 'lon',
    'Altitude': 'altitude',
    'Date_Time': 'DateTime',
    'Id_user': 'traj_id',
    'Label': 'mode_of_transport'
}, axis=1)
gl

,lat,lon,altitude,DateTime,traj_id,Id_perc,mode_of_transport
0,41.741415,86.186028,-777.0,2008-03-31 16:00:08,10,20080331160008.plt,taxi
1,41.737063,86.179470,-777.0,2008-03-31 16:01:07,10,20080331160008.plt,taxi
2,41.734105,86.172823,-777.0,2008-03-31 16:02:07,10,20080331160008.plt,taxi
3,41.739110,86.166563,-777.0,2008-03-31 16:03:06,10,20080331160008.plt,taxi
4,41.744368,86.159987,-777.0,2008-03-31 16:04:05,10,20080331160008.plt,taxi
...,...,...,...,...,...,...,...
3387298,40.070186,116.314153,-45.0,2008-11-29 02:01:31,179,20081129015805.plt,bus
3387299,40.070193,116.314041,-48.0,2008-11-29 02:01:33,179,20081129015805.plt,bus
3387300,40.070224,116.313923,-51.0,2008-11-29 02:01:35,179,20081129015805.plt,bus
3387301,40.070227,116.313843,-56.0,2008-11-29 02:01:37,179,20081129015805.plt,bus
3387302,40.070242,116.313808,-58.0,2008-11-29 02:01:39,179,20081129015805.plt,bus

In [4]:
gl = gl.drop(columns=['altitude', 'Id_perc'])
gl

               lat         lon             DateTime  traj_id mode_of_transport
0        41.741415   86.186028  2008-03-31 16:00:08       10              taxi
1        41.737063   86.179470  2008-03-31 16:01:07       10              taxi
2        41.734105   86.172823  2008-03-31 16:02:07       10              taxi
3        41.739110   86.166563  2008-03-31 16:03:06       10              taxi
4        41.744368   86.159987  2008-03-31 16:04:05       10              taxi
...            ...         ...                  ...      ...               ...
3387298  40.070186  116.314153  2008-11-29 02:01:31      179               bus
3387299  40.070193  116.314041  2008-11-29 02:01:33      179               bus
3387300  40.070224  116.313923  2008-11-29 02:01:35      179               bus
3387301  40.070227  116.313843  2008-11-29 02:01:37      179               bus
3387302  40.070242  116.313808  2008-11-29 02:01:39      179               bus

[3387303 rows x 5 columns]

In [5]:
gl.mode_of_transport.value_counts()

walk        972671
bus         756878
bike        702384
car         388238
train       210267
subway      188648
taxi        157175
airplane      5915
boat          3443
run           1684
Name: mode_of_transport, dtype: int64

In [6]:
small = gl.loc[gl.mode_of_transport.isin(['subway', 'taxi', 'airplane', 'boat'])]
small

               lat         lon             DateTime  traj_id mode_of_transport
0        41.741415   86.186028  2008-03-31 16:00:08       10              taxi
1        41.737063   86.179470  2008-03-31 16:01:07       10              taxi
2        41.734105   86.172823  2008-03-31 16:02:07       10              taxi
3        41.739110   86.166563  2008-03-31 16:03:06       10              taxi
4        41.744368   86.159987  2008-03-31 16:04:05       10              taxi
...            ...         ...                  ...      ...               ...
3386631  40.069492  116.313471  2008-11-17 06:52:12      179            subway
3386632  40.069507  116.313674  2008-11-17 06:52:14      179            subway
3386633  40.069525  116.313867  2008-11-17 06:52:16      179            subway
3386634  40.069563  116.314057  2008-11-17 06:52:18      179            subway
3386635  40.069595  116.314256  2008-11-17 06:52:20      179            subway

[355181 rows x 5 columns]

In [7]:
small.mode_of_transport = small.mode_of_transport.map({
    'subway': 0,
    'taxi': 1,
    'airplane': 2,
    'boat': 3,
})
small

/home/yjharanwala/anaconda3/envs/ptrail_dev/lib/python3.7/site-packages/pandas/core/generic.py:5516: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

,lat,lon,DateTime,traj_id,mode_of_transport
0,41.741415,86.186028,2008-03-31 16:00:08,10,1
1,41.737063,86.179470,2008-03-31 16:01:07,10,1
2,41.734105,86.172823,2008-03-31 16:02:07,10,1
3,41.739110,86.166563,2008-03-31 16:03:06,10,1
4,41.744368,86.159987,2008-03-31 16:04:05,10,1
...,...,...,...,...,...
3386631,40.069492,116.313471,2008-11-17 06:52:12,179,0
3386632,40.069507,116.313674,2008-11-17 06:52:14,179,0
3386633,40.069525,116.313867,2008-11-17 06:52:16,179,0
3386634,40.069563,116.314057,2008-11-17 06:52:18,179,0
3386635,40.069595,116.314256,2008-11-17 06:52:20,179,0

In [8]:
small.mode_of_transport.value_counts()

0    188648
1    157175
2      5915
3      3443
Name: mode_of_transport, dtype: int64

In [9]:
small.to_csv('./geolife.csv', index=False)